In [1]:
import pandas as pd
data=pd.read_csv("DSP.csv")

In [2]:
print(data)

   S.NO     NAME  AGE  SALARY
0     1   Charan   22  45,000
1     2   Geetha   28  35,000
2     3   Suresh   34  25,000
3     4     Rani   28  30,000
4     5      Ram   28  20,000

In [3]:
data["SALARY"].max()

'45,000'

In [4]:
data["AGE"].max()

34

In [5]:
data.head(3)

   S.NO     NAME  AGE  SALARY
0     1   Charan   22  45,000
1     2   Geetha   28  35,000
2     3   Suresh   34  25,000

In [6]:
data.tail(4)

   S.NO    NAME  AGE  SALARY
1     2  Geetha   28  35,000
2     3  Suresh   34  25,000
3     4    Rani   28  30,000
4     5     Ram   28  20,000

In [7]:
data[["NAME","SALARY"]]

      NAME  SALARY
0   Charan  45,000
1   Geetha  35,000
2   Suresh  25,000
3     Rani  30,000
4      Ram  20,000

In [15]:
data["AGE"]>25

0    False
1     True
2     True
3     True
4     True
Name: AGE, dtype: bool

In [16]:
data[data["AGE"]>25]

   S.NO    NAME  AGE  SALARY
1     2  Geetha   28  35,000
2     3  Suresh   34  25,000
3     4    Rani   28  30,000
4     5     Ram   28  20,000

In [25]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
S.NO      5 non-null int64
NAME      5 non-null object
AGE       5 non-null int64
SALARY    5 non-null object
dtypes: int64(2), object(2)
memory usage: 288.0+ bytes

In [19]:
type(data)

pandas.core.frame.DataFrame

In [20]:
data

   S.NO     NAME  AGE  SALARY
0     1   Charan   22  45,000
1     2   Geetha   28  35,000
2     3   Suresh   34  25,000
3     4     Rani   28  30,000
4     5      Ram   28  20,000

In [23]:
data["SALARY"]>30000

TypeError: '>' not supported between instances of 'str' and 'int'